
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>模式之服务网格 · Awesome Service Mesh</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="ServiceMesher">
        
        
    
    <link rel="stylesheet" href="../../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-wide-page/wide.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-tags/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../what-service-mesh-why-need/" />
    
    
    <link rel="prev" href="../application-network-functions-with-esbs-api-management-and-now-service-mesh/" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"servicemesher/awesome-servicemesh","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../../">
            
                <a href="../../../">
            
                    
                        <b>1.1.</b>
                    
                    介绍
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">时间线</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../../../timeline/2018.html">
            
                <a href="../../../timeline/2018.html">
            
                    
                        <b>2.1.</b>
                    
                    2018年
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../../../timeline/2017.html">
            
                <a href="../../../timeline/2017.html">
            
                    
                        <b>2.2.</b>
                    
                    2017年
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../../../timeline/2016.html">
            
                <a href="../../../timeline/2016.html">
            
                    
                        <b>2.3.</b>
                    
                    2016年
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="../../../timeline/2015.html">
            
                <a href="../../../timeline/2015.html">
            
                    
                        <b>2.4.</b>
                    
                    2015年
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">业界精英</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../../../master/christian-posta.html">
            
                <a href="../../../master/christian-posta.html">
            
                    
                        <b>3.1.</b>
                    
                    Christian Posta
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="../../../master/daniel_bryant.html">
            
                <a href="../../../master/daniel_bryant.html">
            
                    
                        <b>3.2.</b>
                    
                    Daniel Bryant
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="../../../master/idit_levine.html">
            
                <a href="../../../master/idit_levine.html">
            
                    
                        <b>3.3.</b>
                    
                    Idit Levine
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="../../../master/phil_calcado.html">
            
                <a href="../../../master/phil_calcado.html">
            
                    
                        <b>3.4.</b>
                    
                    Phil Calçado
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="../../../master/william_morgan.html">
            
                <a href="../../../master/william_morgan.html">
            
                    
                        <b>3.5.</b>
                    
                    William Morgan
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Service Mesh</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../service-mesh-next-generation-of-microservice/">
            
                <a href="../service-mesh-next-generation-of-microservice/">
            
                    
                        <b>4.1.</b>
                    
                    Service Mesh：下一代微服务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../application-network-functions-with-esbs-api-management-and-now-service-mesh/">
            
                <a href="../application-network-functions-with-esbs-api-management-and-now-service-mesh/">
            
                    
                        <b>4.2.</b>
                    
                    应用网络功能、ESB、API管理，而今Service Mesh?
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="4.3" data-path="./">
            
                <a href="./">
            
                    
                        <b>4.3.</b>
                    
                    模式之服务网格
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="../what-service-mesh-why-need/">
            
                <a href="../what-service-mesh-why-need/">
            
                    
                        <b>4.4.</b>
                    
                    什么是服务网格以及为什么我们需要服务网格？
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../../.." >模式之服务网格</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6A21;&#x5F0F;&#x4E4B;&#x670D;&#x52A1;&#x7F51;&#x683C;">&#x6A21;&#x5F0F;&#x4E4B;&#x670D;&#x52A1;&#x7F51;&#x683C;</h1>
<blockquote>
<p>&#x539F;&#x6587;&#x4F5C;&#x8005;&#xFF1A;Phil Cal&#xE7;ado</p>
<p>&#x539F;&#x6587;&#x94FE;&#x63A5;&#xFF1A;<a href="http://philcalcado.com/2017/08/03/pattern_service_mesh.html" target="_blank">Pattern: Service Mesh</a></p>
<p>&#x8F6C;&#x8F7D;&#x5730;&#x5740;&#xFF1A;<a href="http://www.infoq.com/cn/articles/pattern-service-mesh?from=awesome-servicemesh" target="_blank">&#x6A21;&#x5F0F;&#x4E4B;&#x670D;&#x52A1;&#x7F51;&#x683C;</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;&#x859B;&#x547D;&#x706F;</p>
<p>&#x58F0;&#x660E;&#xFF1A;&#x8F6C;&#x8F7D;&#x81EA;InfoQ</p>
</blockquote>
<p>&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E3A;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x4E86;&#x5404;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5F15;&#x5165;&#x4E86;&#x5404;&#x79CD;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x4E0D;&#x662F;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x4EEC;&#x4E00;&#x822C;&#x4F1A;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x8FDB;&#x884C;&#x8FDC;&#x7A0B;&#x4EA4;&#x4E92;&#xFF0C;&#x964D;&#x4F4E;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E0E;&#x751F;&#x4FF1;&#x6765;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x4F7F;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x6700;&#x5B89;&#x5168;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x907F;&#x514D;&#x5206;&#x5E03;&#x5F0F;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x6837;&#x4F1A;&#x8BA9;&#x6563;&#x5E03;&#x7684;&#x7CFB;&#x7EDF;&#x51FA;&#x73B0;&#x91CD;&#x590D;&#x7684;&#x903B;&#x8F91;&#x548C;&#x6570;&#x636E;&#x3002;</p>
<p>&#x4F46;&#x884C;&#x4E1A;&#x7684;&#x53D1;&#x5C55;&#x4FC3;&#x4F7F;&#x6211;&#x4EEC;&#x8FC8;&#x51FA;&#x66F4;&#x5927;&#x7684;&#x6B65;&#x4F10;&#xFF0C;&#x5927;&#x578B;&#x7684;&#x96C6;&#x4E2D;&#x5F0F;&#x670D;&#x52A1;&#x53D8;&#x6210;&#x4E86;&#x6570;&#x767E;&#x4E2A;&#x751A;&#x81F3;&#x6570;&#x5343;&#x4E2A;&#x5C0F;&#x578B;&#x670D;&#x52A1;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x53BB;&#x89E3;&#x51B3;&#x65B0;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x5148;&#x662F;&#x4E00;&#x4E9B;&#x4E2A;&#x522B;&#x6848;&#x4F8B;&#xFF0C;&#x540E;&#x6765;&#x95EE;&#x9898;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#x3002;&#x5728;&#x4E0D;&#x65AD;&#x6316;&#x6398;&#x51FA;&#x65B0;&#x95EE;&#x9898;&#x5E76;&#x8BBE;&#x8BA1;&#x51FA;&#x66F4;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5B66;&#x4F1A;&#x603B;&#x7ED3;&#xFF0C;&#x5C06;&#x4E00;&#x4E9B;&#x5E38;&#x89C1;&#x7684;&#x9700;&#x6C42;&#x603B;&#x7ED3;&#x6210;&#x6A21;&#x5F0F;&#x3001;&#x5E93;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x5E73;&#x53F0;&#x3002;</p>
<h2 id="&#x6700;&#x521D;&#x7684;&#x7F51;&#x7EDC;&#x8BA1;&#x7B97;&#x673A;&#x4EA4;&#x4E92;">&#x6700;&#x521D;&#x7684;&#x7F51;&#x7EDC;&#x8BA1;&#x7B97;&#x673A;&#x4EA4;&#x4E92;</h2>
<p>&#x6700;&#x5F00;&#x59CB;&#x4EBA;&#x4EEC;&#x60F3;&#x8C61;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<p><img src="images/1.png" alt=""></p>
<p>&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x901A;&#x8FC7;&#x4E0E;&#x53E6;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x53D1;&#x751F;&#x5BF9;&#x8BDD;&#x6765;&#x5B8C;&#x6210;&#x7528;&#x6237;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x662F;&#x6700;&#x6700;&#x7B80;&#x5355;&#x7684;&#x89C6;&#x56FE;&#xFF0C;&#x56E0;&#x4E3A;&#x5E95;&#x5C42;&#x5F88;&#x591A;&#x4FE1;&#x606F;&#x90FD;&#x88AB;&#x5C4F;&#x853D;&#x6389;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x90A3;&#x4E9B;&#x8D1F;&#x8D23;&#x4F20;&#x8F93;&#x5B57;&#x8282;&#x7801;&#x7684;&#x5C42;&#x548C;&#x4F20;&#x8F93;&#x7535;&#x5B50;&#x4FE1;&#x53F7;&#x7684;&#x5C42;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x7ED9;&#x51FA;&#x7A0D;&#x5FAE;&#x8BE6;&#x7EC6;&#x4E00;&#x70B9;&#x7684;&#x7EC4;&#x4EF6;&#x56FE;&#xFF1A;</p>
<p><img src="images/2.png" alt=""></p>
<p>&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x53D8;&#x79CD;&#x4ECE;50&#x5E74;&#x4EE3;&#x5F00;&#x59CB;&#x5C31;&#x5F97;&#x5230;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x3002;&#x8D77;&#x521D;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5F88;&#x7A00;&#x6709;&#xFF0C;&#x4E5F;&#x5F88;&#x6602;&#x8D35;&#xFF0C;&#x4EBA;&#x4EEC;&#x624B;&#x52A8;&#x7BA1;&#x7406;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x968F;&#x7740;&#x8BA1;&#x7B97;&#x673A;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x666E;&#x53CA;&#xFF0C;&#x4EF7;&#x683C;&#x4E5F;&#x6CA1;&#x90A3;&#x4E48;&#x8D35;&#x4E86;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x6570;&#x91CF;&#x548C;&#x6570;&#x636E;&#x91CF;&#x51FA;&#x73B0;&#x4E86;&#x75AF;&#x72C2;&#x5F0F;&#x7684;&#x589E;&#x957F;&#x3002;&#x4EBA;&#x4EEC;&#x8D8A;&#x6765;&#x8D8A;&#x4F9D;&#x8D56;&#x7F51;&#x7EDC;&#x7CFB;&#x7EDF;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x4EEC;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x4ED6;&#x4EEC;&#x5F00;&#x53D1;&#x7684;&#x670D;&#x52A1;&#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x7528;&#x6237;&#x7684;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x5982;&#x4F55;&#x63D0;&#x5347;&#x7CFB;&#x7EDF;&#x8D28;&#x91CF;&#x6210;&#x4E3A;&#x4EBA;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x7126;&#x70B9;&#x3002;&#x673A;&#x5668;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x627E;&#x5230;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#xFF0C;&#x5904;&#x7406;&#x540C;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x4E0A;&#x7684;&#x5E76;&#x53D1;&#x8FDE;&#x63A5;&#xFF0C;&#x4E0E;&#x975E;&#x76F4;&#x63A5;&#x8FDE;&#x63A5;&#x7684;&#x673A;&#x5668;&#x53D1;&#x751F;&#x901A;&#x4FE1;&#xFF0C;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x8DEF;&#x7531;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x2026;&#x2026;</p>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x673A;&#x5236;&#x3002;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x4E0A;&#x6E38;&#x670D;&#x52A1;&#x5668;&#x7ED9;&#x4E0B;&#x6E38;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x8FC7;&#x591A;&#x7684;&#x6570;&#x636E;&#x5305;&#x3002;&#x5728;&#x7F51;&#x7EDC;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x81F3;&#x5C11;&#x4F1A;&#x5B58;&#x5728;&#x4E24;&#x53F0;&#x5BF9;&#x5F7C;&#x6B64;&#x6BEB;&#x65E0;&#x6240;&#x77E5;&#x7684;&#x673A;&#x5668;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x670D;&#x52A1;&#x5668;A&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x901F;&#x7387;&#x5411;&#x670D;&#x52A1;&#x5668;B&#x53D1;&#x9001;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x4F46;&#x670D;&#x52A1;&#x5668;B&#x5E76;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x53CA;&#x65F6;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5305;&#x3002;&#x670D;&#x52A1;&#x5668;B&#x6709;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x5728;&#x5904;&#x7406;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#xFF0C;&#x53C8;&#x6216;&#x8005;&#x6570;&#x636E;&#x5305;&#x5230;&#x8FBE;&#x7684;&#x987A;&#x5E8F;&#x53D1;&#x751F;&#x98A0;&#x5012;&#xFF0C;&#x670D;&#x52A1;&#x5668;B&#x4E00;&#x76F4;&#x5728;&#x7B49;&#x5F85;&#x672C;&#x5E94;&#x5148;&#x5230;&#x8FBE;&#x7684;&#x6570;&#x636E;&#x5305;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0D;&#x4EC5;&#x670D;&#x52A1;&#x5668;A&#x7684;&#x8BF7;&#x6C42;&#x65E0;&#x6CD5;&#x5F97;&#x5230;&#x54CD;&#x5E94;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x53EF;&#x80FD;&#x8BA9;&#x670D;&#x52A1;&#x5668;B&#x8FC7;&#x8F7D;&#xFF0C;&#x56E0;&#x4E3A;&#x670D;&#x52A1;&#x5668;B&#x9700;&#x8981;&#x628A;&#x6570;&#x636E;&#x5305;&#x653E;&#x8FDB;&#x672A;&#x5904;&#x7406;&#x961F;&#x5217;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x671F;&#x5185;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9700;&#x8981;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x91CC;&#x5904;&#x7406;&#x4E0A;&#x8FF0;&#x95EE;&#x9898;&#x3002;&#x5728;&#x4E0B;&#x56FE;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x4E0D;&#x7ED9;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x9020;&#x6210;&#x8FC7;&#x8F7D;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x5904;&#x7406;&#x7F51;&#x7EDC;&#x903B;&#x8F91;&#xFF0C;&#x4E8E;&#x662F;&#x7F51;&#x7EDC;&#x903B;&#x8F91;&#x548C;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5C31;&#x6DF7;&#x6742;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<p><img src="images/3.png" alt=""></p>
<p>&#x6240;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x5F97;&#x5F88;&#x5FEB;&#xFF0C;TCP/IP&#x8FD9;&#x7C7B;&#x6807;&#x51C6;&#x7684;&#x51FA;&#x73B0;&#x89E3;&#x51B3;&#x4E86;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x5C3D;&#x7BA1;&#x7F51;&#x7EDC;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x4F9D;&#x7136;&#x5B58;&#x5728;&#xFF0C;&#x4F46;&#x5DF2;&#x7ECF;&#x4ECE;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x91CC;&#x62BD;&#x79BB;&#x51FA;&#x6765;&#xFF0C;&#x6210;&#x4E3A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p><img src="images/4.png" alt=""></p>
<h2 id="&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x51FA;&#x73B0;">&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x51FA;&#x73B0;</h2>
<p>&#x65F6;&#x8FC7;&#x5883;&#x8FC1;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x8D8A;&#x6765;&#x8D8A;&#x666E;&#x53CA;&#xFF0C;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x4FBF;&#x5B9C;&#xFF0C;&#x4E0A;&#x8FF0;&#x7684;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#x6808;&#x5DF2;&#x7ECF;&#x88AB;&#x8BC1;&#x5B9E;&#x662F;&#x6784;&#x5EFA;&#x53EF;&#x9760;&#x8FDE;&#x63A5;&#x7CFB;&#x7EDF;&#x884C;&#x4E4B;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6848;&#x3002;&#x76F8;&#x4E92;&#x8FDE;&#x63A5;&#x7684;&#x8282;&#x70B9;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x4E1A;&#x754C;&#x51FA;&#x73B0;&#x4E86;&#x5404;&#x79CD;&#x7F51;&#x7EDC;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;&#x5206;&#x5E03;&#x5F0F;&#x4EE3;&#x7406;&#x548C;&#x9762;&#x5411;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x3002;</p>
<p>&#x5206;&#x5E03;&#x5F0F;&#x4E3A;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x4E86;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x80FD;&#x529B;&#x548C;&#x597D;&#x5904;&#xFF0C;&#x4F46;&#x6311;&#x6218;&#x4F9D;&#x7136;&#x5B58;&#x5728;&#x3002;&#x6709;&#x4E9B;&#x6311;&#x6218;&#x662F;&#x5168;&#x65B0;&#x7684;&#xFF0C;&#x4F46;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x53EA;&#x662F;&#x65E7;&#x6709;&#x95EE;&#x9898;&#x7684;&#x5347;&#x7EA7;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x7684;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5728;90&#x5E74;&#x4EE3;&#xFF0C;&#x6765;&#x81EA;Sun Microsystems&#x7684;Peter Deutsch&#x7B49;&#x4EBA;&#x53D1;&#x8868;&#x4E86;&#x201C;<a href="https://en.wikipedia.org/wiki/Fallacies_of_distributed_computing" target="_blank">The8 Fallacies of Distributed Computing</a>&#x201D;&#x3002;Peter&#x5217;&#x51FA;&#x4E86;&#x4EBA;&#x4EEC;&#x5728;&#x4F7F;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x65F6;&#x5BB9;&#x6613;&#x505A;&#x51FA;&#x7684;&#x51E0;&#x9879;&#x5047;&#x8BBE;&#x3002;Peter&#x6307;&#x51FA;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x662F;&#x9488;&#x5BF9;&#x539F;&#x59CB;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x6216;&#x7406;&#x8BBA;&#x6A21;&#x578B;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x5047;&#x8BBE;&#x6216;&#x8BB8;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x4F46;&#x5728;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x3002;</p>
<ol>
<li>&#x7F51;&#x7EDC;&#x662F;&#x53EF;&#x9760;&#x7684;</li>
<li>&#x6CA1;&#x6709;&#x5EF6;&#x8FDF;</li>
<li>&#x5E26;&#x5BBD;&#x662F;&#x65E0;&#x9650;&#x7684;</li>
<li>&#x7F51;&#x7EDC;&#x662F;&#x5B89;&#x5168;&#x7684;</li>
<li>&#x62D3;&#x6251;&#x7ED3;&#x6784;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;</li>
<li>&#x5B58;&#x5728;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x5458;</li>
<li>&#x96F6;&#x4F20;&#x8F93;&#x6210;&#x672C;</li>
<li>&#x7F51;&#x7EDC;&#x662F;&#x540C;&#x8D28;&#x7684;</li>
</ol>
<p>&#x5DE5;&#x7A0B;&#x5E08;&#x4E0D;&#x80FD;&#x5FFD;&#x7565;&#x8FD9;&#x4E9B;&#x201C;&#x8C2C;&#x8BBA;&#x201D;&#xFF0C;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x5728;&#x5F00;&#x53D1;&#x5F53;&#x4E2D;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x662F;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x7ED9;&#x8FD0;&#x7EF4;&#x5E26;&#x6765;&#x4E86;&#x66F4;&#x591A;&#x6311;&#x6218;&#x3002;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x505A;&#x8FC7;&#x4E00;&#x4E9B;&#x8BE6;&#x7EC6;&#x7684;&#x8BA8;&#x8BBA;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x5185;&#x5BB9;&#x7684;&#x8981;&#x70B9;&#x3002;</p>
<ol>
<li>&#x5FEB;&#x901F;&#x5206;&#x914D;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;</li>
<li>&#x57FA;&#x672C;&#x7684;&#x76D1;&#x63A7;</li>
<li>&#x5FEB;&#x901F;&#x90E8;&#x7F72;</li>
<li>&#x6613;&#x4E8E;&#x5206;&#x914D;&#x7684;&#x5B58;&#x50A8;</li>
<li>&#x6613;&#x4E8E;&#x8BBF;&#x95EE;&#x7684;&#x8FB9;&#x754C;</li>
<li>&#x8BA4;&#x8BC1;&#x548C;&#x6388;&#x6743;</li>
<li>&#x6807;&#x51C6;&#x7684;RPC</li>
</ol>
<p>&#x5C3D;&#x7BA1;&#x6570;&#x5341;&#x5E74;&#x524D;&#x51FA;&#x73B0;&#x7684;TCP/IP&#x534F;&#x8BAE;&#x6808;&#x548C;&#x901A;&#x7528;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x4ECD;&#x7136;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x901A;&#x4FE1;&#x6700;&#x4E3A;&#x6709;&#x529B;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x4E00;&#x4E9B;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x67B6;&#x6784;&#x4E5F;&#x50AC;&#x751F;&#x4E86;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5C42;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4EE5;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x548C;&#x56DE;&#x8DEF;&#x65AD;&#x8DEF;&#x5668;&#x4E3A;&#x4F8B;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x6280;&#x672F;&#x88AB;&#x7528;&#x4E8E;&#x89E3;&#x51B3;&#x5F39;&#x6027;&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5386;&#x53F2;&#x603B;&#x662F;&#x60CA;&#x4EBA;&#x7684;&#x76F8;&#x4F3C;&#xFF0C;&#x7B2C;&#x4E00;&#x6279;&#x91C7;&#x7528;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x4F01;&#x4E1A;&#x9075;&#x5FAA;&#x7684;&#x662F;&#x4E0E;&#x7B2C;&#x4E00;&#x4EE3;&#x7F51;&#x7EDC;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x7C7B;&#x4F3C;&#x7684;&#x7B56;&#x7565;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x89E3;&#x51B3;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x95EE;&#x9898;&#x7684;&#x4EFB;&#x52A1;&#x53C8;&#x843D;&#x5728;&#x4E86;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x80A9;&#x4E0A;&#x3002;</p>
<p><img src="images/5.png" alt=""></p>
<p>&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x7684;&#x76EE;&#x7684;&#x662F;&#x627E;&#x5230;&#x6709;&#x80FD;&#x529B;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x7684;&#x670D;&#x52A1;&#x5B9E;&#x4F8B;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6709;&#x4E2A;&#x53EB;&#x4F5C;Teams&#x7684;&#x670D;&#x52A1;&#x9700;&#x8981;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x53EB;&#x4F5C;Players&#x7684;&#x670D;&#x52A1;&#x5B9E;&#x4F8B;&#x3002;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#xFF0C;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;&#x670D;&#x52A1;&#x5668;&#x6E05;&#x5355;&#x3002;&#x5BF9;&#x4E8E;&#x5355;&#x4F53;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;DNS&#x3001;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x548C;&#x7AEF;&#x53E3;&#x673A;&#x5236;&#xFF08;&#x6BD4;&#x5982;&#x901A;&#x8FC7;HTTP&#x670D;&#x52A1;&#x5668;&#x7684;8080&#x7AEF;&#x53E3;&#x6765;&#x7ED1;&#x5B9A;&#x670D;&#x52A1;&#xFF09;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x800C;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x91CC;&#xFF0C;&#x4E8B;&#x60C5;&#x5C31;&#x590D;&#x6742;&#x4E86;&#xFF0C;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x9700;&#x8981;&#x5904;&#x7406;&#x66F4;&#x591A;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6BD4;&#x5982;&#x5BA2;&#x6237;&#x7AEF;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3001;&#x591A;&#x73AF;&#x5883;&#xFF08;&#x5982;staging&#x73AF;&#x5883;&#x548C;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#xFF09;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x670D;&#x52A1;&#x5668;&#x7684;&#x7269;&#x7406;&#x4F4D;&#x7F6E;&#x7B49;&#x3002;&#x4E4B;&#x524D;&#x53EF;&#x80FD;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x6765;&#x5904;&#x7406;&#x670D;&#x52A1;&#x5668;&#x540D;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x5904;&#x7406;&#x66F4;&#x591A;&#x7684;&#x8FB9;&#x754C;&#x95EE;&#x9898;&#x3002;</p>
<p>Michael Nygard&#x5728;&#x4ED6;&#x7684;&#x201C;<a href="http://amzn.to/2viDf23" target="_blank">Release It</a>&#x201D;&#x4E00;&#x4E66;&#x4E2D;&#x63D0;&#x5230;&#x4E86;&#x56DE;&#x8DEF;&#x65AD;&#x8DEF;&#x5668;&#x6A21;&#x5F0F;&#x3002;Martin Fowler&#x4E5F;&#x5BF9;&#x8BE5;&#x6A21;&#x5F0F;&#x505A;&#x4E86;&#x603B;&#x7ED3;&#xFF1A;</p>
<blockquote>
<p>&#x56DE;&#x8DEF;&#x65AD;&#x8DEF;&#x5668;&#x80CC;&#x540E;&#x7684;&#x539F;&#x7406;&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5C06;&#x51FD;&#x6570;&#x5C01;&#x88C5;&#x5728;&#x56DE;&#x8DEF;&#x65AD;&#x8DEF;&#x5668;&#x5BF9;&#x8C61;&#x91CC;&#xFF0C;&#x5F53;&#x6545;&#x969C;&#x7387;&#x8FBE;&#x5230;&#x67D0;&#x4E2A;&#x9608;&#x503C;&#xFF0C;&#x56DE;&#x8DEF;&#x65AD;&#x8DEF;&#x5668;&#x5F00;&#x59CB;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#xFF0C;&#x6240;&#x6709;&#x53D1;&#x7ED9;&#x56DE;&#x8DEF;&#x65AD;&#x8DEF;&#x5668;&#x7684;&#x8BF7;&#x6C42;&#x90FD;&#x5C06;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BF7;&#x6C42;&#x65E0;&#x6CD5;&#x89E6;&#x53CA;&#x5230;&#x88AB;&#x4FDD;&#x62A4;&#x7684;&#x51FD;&#x6570;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x5728;&#x56DE;&#x8DEF;&#x65AD;&#x8DEF;&#x5668;&#x6253;&#x5F00;&#x65F6;&#x53D1;&#x51FA;&#x544A;&#x8B66;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x4F46;&#x80FD;&#x4FDD;&#x8BC1;&#x670D;&#x52A1;&#x95F4;&#x4EA4;&#x4E92;&#x53EF;&#x9760;&#x6027;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x968F;&#x7740;&#x5206;&#x5E03;&#x5F0F;&#x89C4;&#x6A21;&#x7684;&#x589E;&#x957F;&#xFF0C;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x90FD;&#x4F1A;&#x8D8B;&#x4E8E;&#x590D;&#x6742;&#x3002;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x91CC;&#xFF0C;&#x53D1;&#x751F;&#x95EE;&#x9898;&#x7684;&#x6982;&#x7387;&#x5448;&#x6307;&#x6570;&#x7EA7;&#x589E;&#x957F;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#x4E5F;&#x4E0D;&#x80FD;&#x7B49;&#x95F2;&#x89C6;&#x4E4B;&#xFF0C;&#x6BD4;&#x5982;&#x50CF;&#x201C;&#x5728;&#x56DE;&#x8DEF;&#x65AD;&#x8DEF;&#x5668;&#x6253;&#x5F00;&#x65F6;&#x53D1;&#x51FA;&#x544A;&#x8B66;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x5C0F;&#x4E8B;&#x3002;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x53D1;&#x751F;&#x6545;&#x969C;&#x5C06;&#x4F1A;&#x7EA7;&#x8054;&#x5730;&#x5F71;&#x54CD;&#x5230;&#x591A;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4E00;&#x4F20;&#x5341;&#xFF0C;&#x5341;&#x4F20;&#x767E;&#xFF0C;&#x6700;&#x540E;&#x53EF;&#x80FD;&#x6709;&#x6570;&#x5343;&#x4E2A;&#x56DE;&#x8DEF;&#x540C;&#x65F6;&#x88AB;&#x6253;&#x5F00;&#x3002;&#x5148;&#x524D;&#x7684;&#x95EE;&#x9898;&#x53EA;&#x9700;&#x8981;&#x51E0;&#x884C;&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x4EE3;&#x7801;&#x624D;&#x80FD;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x65B0;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8981;&#x5B9E;&#x73B0;&#x597D;&#x4E0A;&#x8FF0;&#x7684;&#x4E24;&#x79CD;&#x6A21;&#x5F0F;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x50CF;Twitter&#x7684;<a href="https://finagle.github.io/" target="_blank">Finagle</a>&#x548C;Facebook&#x7684;<a href="https://code.facebook.com/posts/1503205539947302" target="_blank">Proxygen</a>&#x8FD9;&#x6837;&#x7684;&#x5927;&#x578B;&#x6846;&#x67B6;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x4FBF;&#x5229;&#x3002;</p>
<p><img src="images/5-a.png" alt=""></p>
<p>&#x5F88;&#x591A;&#x91C7;&#x7528;&#x4E86;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x516C;&#x53F8;&#x9075;&#x5FAA;&#x4E86;&#x4E0A;&#x56FE;&#x4E2D;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x5982;Netflix&#x3001;Twitter&#x548C;SoundCloud&#x3002;&#x4E0D;&#x8FC7;&#x968F;&#x7740;&#x670D;&#x52A1;&#x6570;&#x91CF;&#x7684;&#x589E;&#x957F;&#xFF0C;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x4E5F;&#x65F6;&#x5E38;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x4F7F;&#x7528;&#x4E86;Finagle&#xFF0C;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x6295;&#x5165;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x53BB;&#x6253;&#x901A;&#x5404;&#x4E2A;&#x7CFB;&#x7EDF;&#x3002;&#x4ECE;&#x6211;&#x5728;SoundCloud&#x548C;DigitalOcean&#x7684;&#x7ECF;&#x9A8C;&#x6765;&#x770B;&#xFF0C;&#x4E00;&#x4E2A;&#x62E5;&#x6709;100&#x5230;250&#x4E2A;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x4F01;&#x4E1A;&#xFF0C;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x6295;&#x5165;&#x5341;&#x5206;&#x4E4B;&#x4E00;&#x7684;&#x4EBA;&#x529B;&#x5728;&#x6784;&#x5EFA;&#x5DE5;&#x5177;&#x4E0A;&#x3002;&#x8FD9;&#x79CD;&#x6210;&#x672C;&#x6709;&#x65F6;&#x5019;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x90E8;&#x5206;&#x5DE5;&#x7A0B;&#x5E08;&#x88AB;&#x5B89;&#x6392;&#x4E13;&#x804C;&#x8D1F;&#x8D23;&#x6784;&#x5EFA;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x5B83;&#x4E5F;&#x4F1A;&#x5B58;&#x5728;&#x4E8E;&#x65E0;&#x5F62;&#xFF0C;&#x5E76;&#x201C;&#x541E;&#x566C;&#x201D;&#x6389;&#x672C;&#x8BE5;&#x7528;&#x4E8E;&#x6784;&#x5EFA;&#x4EA7;&#x54C1;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x4E0A;&#x8FF0;&#x7684;&#x65B9;&#x6848;&#x4F1A;&#x9650;&#x5236;&#x53EF;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x3001;&#x8FD0;&#x884C;&#x65F6;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x5FAE;&#x670D;&#x52A1;&#x8F6F;&#x4EF6;&#x5E93;&#x4E00;&#x822C;&#x4E13;&#x6CE8;&#x4E8E;&#x67D0;&#x4E2A;&#x5E73;&#x53F0;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;&#x67D0;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6216;&#x4F7F;&#x7528;&#x4E86;&#x67D0;&#x79CD;&#x8FD0;&#x884C;&#x65F6;&#xFF08;&#x5982;JVM&#xFF09;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x9009;&#x62E9;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x4E0D;&#x652F;&#x6301;&#x539F;&#x5148;&#x8F6F;&#x4EF6;&#x5E93;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x5C06;&#x4EE3;&#x7801;&#x91CD;&#x65B0;&#x79FB;&#x690D;&#x5230;&#x65B0;&#x5E73;&#x53F0;&#x4E0A;&#x3002;&#x79FB;&#x690D;&#x8FC7;&#x7A0B;&#x9700;&#x8981;&#x8017;&#x8D39;&#x5927;&#x91CF;&#x7684;&#x5DE5;&#x7A0B;&#x65F6;&#x95F4;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x4EEC;&#x5FD9;&#x4E8E;&#x6784;&#x5EFA;&#x5DE5;&#x5177;&#x548C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x65E0;&#x6687;&#x987E;&#x53CA;&#x4E1A;&#x52A1;&#x548C;&#x4EA7;&#x54C1;&#x3002;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x4E00;&#x4E9B;&#x4E2D;&#x578B;&#x516C;&#x53F8;&#x51B3;&#x5B9A;&#x53EA;&#x652F;&#x6301;&#x5355;&#x4E00;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x6BD4;&#x5982;SoundCloud&#x4EC5;&#x652F;&#x6301;Scala&#xFF0C;DigitalOcean&#x4EC5;&#x652F;&#x6301;Go&#x8BED;&#x8A00;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x662F;&#x76D1;&#x7BA1;&#x95EE;&#x9898;&#x3002;&#x5C3D;&#x7BA1;&#x8F6F;&#x4EF6;&#x5E93;&#x5C01;&#x88C5;&#x4E86;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x7EC4;&#x4EF6;&#x672C;&#x8EAB;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x7EF4;&#x62A4;&#x3002;&#x8981;&#x786E;&#x4FDD;&#x6570;&#x5343;&#x4E2A;&#x670D;&#x52A1;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#xFF08;&#x6216;&#x81F3;&#x5C11;&#x662F;&#x517C;&#x5BB9;&#x7684;&#x7248;&#x672C;&#xFF09;&#x7684;&#x8F6F;&#x4EF6;&#x5E93;&#x5E76;&#x4E0D;&#x662F;&#x4EF6;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x3002;&#x6BCF;&#x505A;&#x51FA;&#x4E00;&#x6B21;&#x53D8;&#x66F4;&#x90FD;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x96C6;&#x6210;&#x3001;&#x6D4B;&#x8BD5;&#xFF0C;&#x8FD8;&#x8981;&#x91CD;&#x65B0;&#x90E8;&#x7F72;&#x6240;&#x6709;&#x7684;&#x670D;&#x52A1;&#x2014;&#x2014;&#x5C3D;&#x7BA1;&#x670D;&#x52A1;&#x672C;&#x8EAB;&#x5E76;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;</p>
<h2 id="&#x4E0B;&#x4E00;&#x6B65;">&#x4E0B;&#x4E00;&#x6B65;</h2>
<p>&#x4E0E;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x6808;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x6025;&#x5207;&#x5730;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5C06;&#x5206;&#x5E03;&#x5F0F;&#x670D;&#x52A1;&#x6240;&#x9700;&#x8981;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x6027;&#x653E;&#x5230;&#x5E95;&#x5C42;&#x7684;&#x5E73;&#x53F0;&#x4E2D;&#x3002;</p>
<p>&#x4EBA;&#x4EEC;&#x57FA;&#x4E8E;HTTP&#x534F;&#x8BAE;&#x5F00;&#x53D1;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x65E0;&#x9700;&#x5173;&#x5FC3;&#x5E95;&#x5C42;TCP&#x5982;&#x4F55;&#x63A7;&#x5236;&#x6570;&#x636E;&#x5305;&#x3002;&#x5728;&#x5F00;&#x53D1;&#x5FAE;&#x670D;&#x52A1;&#x65F6;&#x4E5F;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x4EEC;&#x805A;&#x7126;&#x5728;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4E0A;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x53BB;&#x7F16;&#x5199;&#x670D;&#x52A1;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4EE3;&#x7801;&#x6216;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x7528;&#x5230;&#x7684;&#x8F6F;&#x4EF6;&#x5E93;&#x548C;&#x6846;&#x67B6;&#x3002;</p>
<p>&#x628A;&#x8FD9;&#x79CD;&#x60F3;&#x6CD5;&#x56CA;&#x62EC;&#x8FDB;&#x6211;&#x4EEC;&#x7684;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x5C31;&#x662F;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x7684;&#x6837;&#x5B50;&#x3002;</p>
<p><img src="images/6.png" alt=""></p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x5728;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x6808;&#x4E2D;&#x52A0;&#x5165;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x5C42;&#x662F;&#x4E0D;&#x5B9E;&#x9645;&#x7684;&#x3002;&#x5F88;&#x591A;&#x5148;&#x9A71;&#x8005;&#x4EEC;&#x4F7F;&#x7528;&#x4E00;&#x7CFB;&#x5217;&#x4EE3;&#x7406;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x4E0D;&#x4F1A;&#x76F4;&#x63A5;&#x4E0E;&#x5B83;&#x7684;&#x4F9D;&#x8D56;&#x9879;&#x53D1;&#x751F;&#x8FDE;&#x63A5;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6D41;&#x91CF;&#x90FD;&#x4F1A;&#x6D41;&#x7ECF;&#x4EE3;&#x7406;&#xFF0C;&#x4EE3;&#x7406;&#x4F1A;&#x5B9E;&#x73B0;&#x6240;&#x6709;&#x5FC5;&#x9700;&#x7684;&#x7279;&#x6027;&#x3002;</p>
<p>&#x5728;&#x9996;&#x6279;&#x6709;&#x6587;&#x6863;&#x8BB0;&#x5F55;&#x7684;&#x5F00;&#x53D1;&#x6848;&#x4F8B;&#x4E2D;&#xFF0C;&#x51FA;&#x73B0;&#x4E86;&#x8FB9;&#x8F66;&#xFF08;sidecar&#xFF09;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x3002;&#x8FB9;&#x8F66;&#x5C31;&#x662F;&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E00;&#x8D77;&#x8FD0;&#x884C;&#x7684;&#x72EC;&#x7ACB;&#x8FDB;&#x7A0B;&#xFF0C;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x989D;&#x5916;&#x7684;&#x529F;&#x80FD;&#x3002;2013&#x5E74;&#xFF0C;Airbnb&#x5F00;&#x53D1;&#x4E86;<a href="https://medium.com/airbnb-engineering/smartstack-service-discovery-in-the-cloud-4b8a080de619" target="_blank">Synapse&#x548C;Nerve</a>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FB9;&#x8F66;&#x7684;&#x4E00;&#x79CD;&#x5F00;&#x6E90;&#x5B9E;&#x73B0;&#x3002;&#x4E00;&#x5E74;&#x4E4B;&#x540E;&#xFF0C;Netflix&#x53D1;&#x5E03;&#x4E86;<a href="https://medium.com/netflix-techblog/prana-a-sidecar-for-your-netflix-paas-based-applications-and-services-258a5790a015" target="_blank">Prana</a>&#xFF0C;&#x5B83;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x8FB9;&#x8F66;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x975E;JVM&#x5E94;&#x7528;&#x63A5;&#x5165;&#x4ED6;&#x4EEC;&#x7684;NetflixOSS&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x3002;&#x5728;SoundCloud&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x5F00;&#x53D1;&#x4E86;&#x4E00;&#x4E9B;&#x8FB9;&#x8F66;&#xFF0C;&#x8BA9;&#x9057;&#x7559;&#x7684;Ruby&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x4E3A;JVM&#x5FAE;&#x670D;&#x52A1;&#x800C;&#x6784;&#x5EFA;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<p><img src="images/6-a.png" alt=""></p>
<p>&#x5927;&#x591A;&#x6570;&#x5F00;&#x6E90;&#x7684;&#x4EE3;&#x7406;&#x662F;&#x4E3A;&#x7279;&#x5B9A;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7EC4;&#x4EF6;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Airbnb&#x7684;Nerve&#x548C;Synapse&#x5047;&#x8BBE;&#x670D;&#x52A1;&#x4E00;&#x5B9A;&#x662F;&#x6CE8;&#x518C;&#x5230;ZooKeeper&#x4E0A;&#x7684;&#xFF0C;&#x800C;Prana&#x8981;&#x6C42;&#x4E00;&#x5B9A;&#x8981;&#x4F7F;&#x7528;Netflix&#x81EA;&#x5DF1;&#x7684;<a href="https://github.com/Netflix/eureka" target="_blank">Eureka&#x6CE8;&#x518C;&#x670D;&#x52A1;</a>&#x3002;</p>
<p>&#x968F;&#x7740;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x65E5;&#x6E10;&#x6D41;&#x884C;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x770B;&#x5230;&#x4E86;&#x65B0;&#x4E00;&#x6CE2;&#x7684;&#x4EE3;&#x7406;&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x4E0D;&#x540C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7EC4;&#x4EF6;&#x4E0A;&#x3002;<a href="https://buoyant.io/2016/02/18/linkerd-twitter-style-operability-for-microservices/" target="_blank">Linkerd</a>&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x8F83;&#x4E3A;&#x51FA;&#x540D;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x5B83;&#x662F;Buoyant&#x516C;&#x53F8;&#x57FA;&#x4E8E;Twitter&#x5FAE;&#x670D;&#x52A1;&#x5E73;&#x53F0;&#x800C;&#x5F00;&#x53D1;&#x7684;&#x3002;&#x800C;&#x4E0D;&#x4E45;&#x4E4B;&#x524D;&#xFF0C;Lyft&#x5BA3;&#x5E03;<a href="https://eng.lyft.com/announcing-envoy-c-l7-proxy-and-communication-bus-92520b6c8191" target="_blank">Envoy</a>&#x6210;&#x4E3A;CNCF&#x7684;&#x5B98;&#x65B9;&#x9879;&#x76EE;&#x3002;</p>
<h2 id="service-mesh&#xFF08;&#x670D;&#x52A1;&#x7F51;&#x683C;&#xFF09;">Service Mesh&#xFF08;&#x670D;&#x52A1;&#x7F51;&#x683C;&#xFF09;</h2>
<p>&#x5728;&#x8FD9;&#x6837;&#x7684;&#x6A21;&#x578B;&#x91CC;&#xFF0C;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x8FB9;&#x8F66;&#x4EE3;&#x7406;&#x4E0E;&#x4E4B;&#x914D;&#x5BF9;&#x3002;&#x670D;&#x52A1;&#x95F4;&#x901A;&#x4FE1;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x8FB9;&#x8F66;&#x4EE3;&#x7406;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x5982;&#x4E0B;&#x7684;&#x90E8;&#x7F72;&#x56FE;&#x3002;</p>
<p><img src="images/mesh1.png" alt=""></p>
<p>Buoyant&#x7684;CEO <a href="https://en.wikipedia.org/wiki/Mesh_networking" target="_blank">William Morgan</a>&#x53D1;&#x73B0;&#xFF0C;&#x4EE3;&#x7406;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x79CD;&#x7F51;&#x683C;&#x7F51;&#x7EDC;&#x3002;2017&#x5E74;&#x521D;&#xFF0C;William&#x5BF9;&#x8FD9;&#x6837;&#x7684;&#x5E73;&#x53F0;&#x505A;&#x51FA;&#x4E86;&#x5B9A;&#x4E49;&#xFF0C;&#x5E76;&#x79F0;&#x4E4B;&#x4E3A;Service Mesh&#xFF1A;</p>
<blockquote>
<p>&#x670D;&#x52A1;&#x7F51;&#x683C;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#xFF0C;&#x7528;&#x4E8E;&#x5904;&#x7406;&#x670D;&#x52A1;&#x95F4;&#x901A;&#x4FE1;&#x3002;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x6709;&#x7740;&#x590D;&#x6742;&#x7684;&#x670D;&#x52A1;&#x62D3;&#x6251;&#xFF0C;&#x670D;&#x52A1;&#x7F51;&#x683C;&#x4FDD;&#x8BC1;&#x8BF7;&#x6C42;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E9B;&#x62D3;&#x6251;&#x4E2D;&#x53EF;&#x9760;&#x5730;&#x7A7F;&#x68AD;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x5F53;&#x4E2D;&#xFF0C;&#x670D;&#x52A1;&#x7F51;&#x683C;&#x901A;&#x5E38;&#x662F;&#x7531;&#x4E00;&#x7CFB;&#x5217;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x7F51;&#x7EDC;&#x4EE3;&#x7406;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4F46;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#x6700;&#x5F3A;&#x6709;&#x529B;&#x7684;&#x90E8;&#x5206;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x4E0D;&#x518D;&#x628A;&#x4EE3;&#x7406;&#x770B;&#x6210;&#x5355;&#x72EC;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x5E76;&#x5F3A;&#x8C03;&#x4E86;&#x8FD9;&#x4E9B;&#x4EE3;&#x7406;&#x6240;&#x5F62;&#x6210;&#x7684;&#x7F51;&#x7EDC;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;</p>
<p><img src="images/mesh2.png" alt=""></p>
<p>&#x7EC4;&#x7EC7;&#x5F00;&#x59CB;&#x5C06;&#x4ED6;&#x4EEC;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x90E8;&#x7F72;&#x5230;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#xFF08;&#x5982;Kubernetes&#x548C;Mesos&#xFF09;&#x4E0A;&#xFF0C;&#x5E76;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5E73;&#x53F0;&#x63D0;&#x4F9B;&#x7684;&#x7F51;&#x683C;&#x7F51;&#x7EDC;&#x5DE5;&#x5177;&#x3002;&#x4ED6;&#x4EEC;&#x6B63;&#x4ECE;&#x4F7F;&#x7528;&#x4E00;&#x7CFB;&#x5217;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x7684;&#x4EE3;&#x7406;&#x8F6C;&#x5411;&#x4F7F;&#x7528;&#x96C6;&#x4E2D;&#x5F0F;&#x7684;&#x63A7;&#x5236;&#x9762;&#x677F;&#x3002;</p>
<p><img src="images/6-b.png" alt=""></p>
<p>&#x4ECE;&#x9E1F;&#x77B0;&#x56FE;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x670D;&#x52A1;&#x7684;&#x5B9E;&#x9645;&#x6D41;&#x91CF;&#x4ECD;&#x7136;&#x5728;&#x4EE3;&#x7406;&#x95F4;&#x6D41;&#x8F6C;&#xFF0C;&#x4E0D;&#x8FC7;&#x63A7;&#x5236;&#x9762;&#x677F;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x4EE3;&#x7406;&#x5B9E;&#x4F8B;&#x4E86;&#x5982;&#x6307;&#x638C;&#xFF0C;&#x901A;&#x8FC7;&#x63A7;&#x5236;&#x9762;&#x677F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4EE3;&#x7406;&#x7684;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x548C;&#x5EA6;&#x91CF;&#x6307;&#x6807;&#x6536;&#x96C6;&#x3002;</p>
<p><img src="images/mesh3.png" alt=""></p>
<p>&#x6700;&#x8FD1;&#x53D1;&#x5E03;&#x7684;<a href="https://istio.io/" target="_blank">Istio</a>&#x5C31;&#x662F;&#x8FD9;&#x7C7B;&#x7CFB;&#x7EDF;&#x6700;&#x4E3A;&#x7A81;&#x51FA;&#x7684;&#x4EE3;&#x8868;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x65E0;&#x6CD5;&#x5BF9;Service Mesh&#x5C06;&#x7ED9;&#x5927;&#x89C4;&#x6A21;&#x7CFB;&#x7EDF;&#x5E26;&#x6765;&#x600E;&#x6837;&#x7684;&#x5F71;&#x54CD;&#x505A;&#x51FA;&#x5168;&#x9762;&#x7684;&#x5B9A;&#x8BBA;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x81F3;&#x5C11;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x4E00;&#x4E9B;&#x516C;&#x5171;&#x7EC4;&#x4EF6;&#x5DF2;&#x7ECF;&#x662F;&#x73B0;&#x6210;&#x7684;&#xFF0C;&#x5F88;&#x591A;&#x5C0F;&#x516C;&#x53F8;&#x53EF;&#x4EE5;&#x4EAB;&#x53D7;&#x5230;&#x4E4B;&#x524D;&#x53EA;&#x6709;&#x5927;&#x516C;&#x53F8;&#x624D;&#x80FD;&#x4EAB;&#x53D7;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x6027;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x6211;&#x4EEC;&#x6216;&#x8BB8;&#x80FD;&#x591F;&#x56E0;&#x6B64;&#x4F7F;&#x7528;&#x6700;&#x597D;&#x7684;&#x5DE5;&#x5177;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x62C5;&#x5FC3;&#x4E0D;&#x540C;&#x5E73;&#x53F0;&#x5BF9;&#x8F6F;&#x4EF6;&#x5E93;&#x548C;&#x6A21;&#x5F0F;&#x7684;&#x652F;&#x6301;&#x5B58;&#x5728;&#x5DEE;&#x5F02;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../application-network-functions-with-esbs-api-management-and-now-service-mesh/" class="navigation navigation-prev " aria-label="Previous page: 应用网络功能、ESB、API管理，而今Service Mesh?">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../what-service-mesh-why-need/" class="navigation navigation-next " aria-label="Next page: 什么是服务网格以及为什么我们需要服务网格？">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"模式之服务网格","level":"4.3","depth":1,"next":{"title":"什么是服务网格以及为什么我们需要服务网格？","level":"4.4","depth":1,"path":"mesh/2017/what-service-mesh-why-need/index.md","ref":"mesh/2017/what-service-mesh-why-need/index.md","articles":[]},"previous":{"title":"应用网络功能、ESB、API管理，而今Service Mesh?","level":"4.2","depth":1,"path":"mesh/2017/application-network-functions-with-esbs-api-management-and-now-service-mesh/index.md","ref":"mesh/2017/application-network-functions-with-esbs-api-management-and-now-service-mesh/index.md","articles":[]},"dir":"ltr"},"config":{"plugins":["splitter","-lunr","-search","search-plus","-sharing","theme-default","edit-link","page-toc-button","back-to-top-button","github-buttons@2.1.0","wide-page","tags"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"splitter":{},"wide-page":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"github-buttons":{"repo":"servicemesher/awesome-servicemesh","types":["star"],"size":"small"},"tags":{"placement":"top"},"edit-link":{"label":"在线编辑","base":"https://github.com/servicemesher/awesome-servicemesh/edit/master"},"theme-default":{"showLevel":true,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{}},"theme":"default","author":"ServiceMesher","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Awesome Service Mesh","language":"zh-hans","gitbook":">=3.2.0","description":"Awesome Service Mesh","extension":null},"file":{"path":"mesh/2017/pattern-service-mesh/index.md","mtime":"2018-05-14T07:58:40.341Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-22T04:13:27.152Z"},"basePath":"../../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../../gitbook/gitbook.js"></script>
    <script src="../../../gitbook/theme.js"></script>
    
        
        <script src="../../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

